{"architecture":{"module":"keras.src.models.functional","class_name":"Functional","config":{"name":"functional","trainable":true,"layers":[{"module":"keras.layers","class_name":"InputLayer","config":{"batch_shape":[null,15],"dtype":"float32","sparse":false,"name":"in"},"registered_name":null,"name":"in","inbound_nodes":[]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,15]},"name":"dense1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,15],"dtype":"float32","keras_history":["in",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,32]},"name":"dense2","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,32],"dtype":"float32","keras_history":["dense1",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"out","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":2,"activation":"softmax","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,16]},"name":"out","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,16],"dtype":"float32","keras_history":["dense2",0,0]}}],"kwargs":{}}]}],"input_layers":[["in",0,0]],"output_layers":[["out",0,0]]},"registered_name":"Functional","build_config":{"input_shape":null},"compile_config":{"optimizer":{"module":"keras.optimizers","class_name":"SGD","config":{"name":"SGD","learning_rate":0.009999999776482582,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"momentum":0.0,"nesterov":false},"registered_name":null},"loss":"mse","loss_weights":null,"metrics":null,"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":false}},"image_data_format":"channels_last","input_shapes":[[15]],"output_shapes":[[2]],"trainable_params":{"dense1":{"weights":["0nvFPs9To74GYFo+kG4xvh9Ow765e609l2wSPTzX0j77UpK+PQRUvdkwLL7VfxU9wk4yvoIWtD4ZcIy9Hc0MvsJ3qTyOMuk9dBSCvpi14L3VAJa9M6LOPsbWoL004pO+gf+RPoKdqDuLXmm+OCW/Pu2jhL6/D6m+m5LbPDdIhD7rKOo808oTPok5IL3ONy6+iEK5PNZjpT5EcSc+N/CFvcpUh73VZMe+pvfXPFli870hmKa+eGadPiVg9L0Sacy9+PnUvnKulb59CBc+dD4tvi7tVr2pnUW+H2i+vso+oz5DpDc8gk+zPtk4Oj7fuSy+IEanvYiJtL3HOh89uTaJPpYZtj4bTiQ9h0NBPZiHZ75Pmqe+si+uPAczBr6ihwu+9fdNvpuhP7wTcH+9qI91vhefij7g8Jm+4NqVPuPQj768mWI9Lto2voWaQr5VvZw+aue6PglcGD4HZKy+wIOXPksF8bvRJ8k8YZ9VPrywQD6wtay+AeW9PiWz3b3dN3I909hOPYJwgD5TTgW+UKo/PQYqmLzyEya+liN+PegvB7780ac+bzAVvhaYwr0P5289mjeYvCnxlT7Z3kK9tSvHviuEpb4LMMi+LRAyPbYPTz6z0r8+hDkBPg0oKL6iFAC+DmZXPgQsmD79jk++VapMvtJErL4j6nw+yrfBvlP1db011YK+LSW0PaTLt75S56g+bLy6vp/TV71DK8A+wwZxvDlzlD4UHsE9layWvbBsjz6T6oY9L2xuPoymgT1MATS+mb8AvnBT/DzdyIU+YTcMvtzZRD29Y3W+XeOmvdvRmr5jruk8/p0VvmKHtb3yr0y+Pq6uvsUAV76XPcW+0KP5PXtrfz6BwIk+iixOPqJPGj4v5aa9uSRhvmkckz4rJnE+QTNkvoa7yj6PHgq+6yqbvS7RhT4mU3e+OgK1PhJFsr4DfZU+2Mqsvk/v1rv8lim+RQGhvuX8ob72NnO9KsUBPhj4Mb6VVuk9J2NVvqZg3r6bCXe9lRSrviOYA7/MyuG+","LWmQvpSzm759dyI+oVePPndfHb6syW49lBcPvugVAT4jTXM+qCabvgvWQL4RrYs+oQe5PTrZCD7pxmu+2vugPBsR4D3yavQ9KcykvlO5fD7s5gy++8i7vloLuj1CvCq64xsxvllWkL54F8A9GsJivpK57Ly++EU+sZvkvU/umL2aI4K+Rkh+vt02y72ko8++TA7mvZ9IRr75G/w90ZvDvjREij47gw++zXuDPrpKrD66JyC+UKBVPGidxz1OYcS937WFviT70r1bcIy+DTN6PoZPJL63Na09lgpqvpC4Vb0/3Xc9D7qSviU/sj7xpOo8IqmzPbcmu74U45g+WEHKvZMhvz4mRGa+iFTfviLJH7533jk+xiCGvoVDfz7UPiQ+eRSovvPGVL4nOUu+EDV9Pqwfmj7tdPi9HdI8vrsGlj7qsLW+pyyQPp0x0r15DQ6+rQzrPZASPz6ZHBy8e6acPbMXkD7xMXk+t350PlLJTD5JKws82jk4PmhZOD01vf49S7gcPqR5sj4aDZW+UkWhvb/RXb4WrKQ+olhNvnkxB73er2m+ImFqPjH+Kj6kOZW+0bKpvHtFij4dpIE+QePUPWHEQ74LHqk+0BpXPU+3mL6rdtu98FaIvuPVoL5HC0q7+YBpvlIBgb5afaw+AQyPvkOMgb69sb2+vhmgvqVjw73O4E6+dEmfPtJG4L1z9SG+IEEIPsABLjx/ViG+mE4hPuAXMjy8Uly+yA2cPnD4Xj22HpK+uhAqvpSOGD7IcLM+IEAePQjYbr1iFa++YmywPmSNnz4Sio8+vRJDvkB7zbzGbok+AJsGPHjDbD5hiES+iAAlPtNCtb5AUqC8dZxgvjq8mr7dYp++4PZkPOBIq72A+Vo9TAmBPv9hOr4w4CE+kB8fPgNOLr4nDqy+9O8wPoD3yL0+zBC+tsGivsC6lLzJkaC++6GkvqjLJT5U2r89ZLJVvuT3sT7WorM+yCkAPvM2nb5FpLC+GzxLviDdGry4rI4+kNCoPHKYlr4oVja9","AHhFOsCSYz78VwK+lOEKPs7ppz6YBCM+CLqEPqQ3lj1gNHk84CEsPOH+TL6OqAK+tBufPf8NmL74oeI9fTS2vqjqWD2U2aq94hGnPqIW+71g1q6+iDwVPlCka75oIC4+IA/GPWBzbD1te52+aOILvWA/iL4s6ro9clAGvqwLTj7FH5Q+iPKSvs4ajb6QMTa+//FiPjMemL5+8uK9RLMhvjHAgb1sJI2+98+cPqh4C77zK+M9bqmCvsmrkT4vFak+ZfIjPm3InL4VeFi+4//4PFxC0T1ocUu8+omZPULTdD32ble+HDfDPnyuWD4ctWa+nuMlPpAxor4rFwW+2vV+Pthsjj4w4Fc+BCmjPuoxBD44DZ89/B1aPqhoOz48q4M9ZzAIvoxdqj5IGSW9KlQNPgaMlL6FabK+uPKRvchhiz725/y91jJWvsMil75k+qg9fOtSvni7Pb3wzzw+gAZyPZCckTzggpQ8ScMcvvA+C70KsEa+7/GVvpihnD2df6S+"],"bias":["p6CMPQ3OKT3EbyC8ixGUuorVhT2a8cc8S1mjvSMkFL1c4gu8GSNVPFLNL7ts9ZO8BfW3vA60Rj0codC8qjeCPVxKG7p57x69tq0evTr0F73cSw09uqcsunBypT0FPaO8YITTvMEGij2+FKK9L/3lvATz0zzPZAs950enPSxCtb0="]},"dense2":{"weights":["oz4FvqwCJT6GC2y+wJAbPQr9Oj3Urea9/T44vuJ7uj5PDuO8fVoNPQjF2b0zHG4+IptvPn9yIb2Xb9i7rEyjPnkMkj2VmBg+8eFePuoiD76TC6A+JTz8PRgPvL7FYri9RAwYP/Byzz2dTmA+ae4pvoBFIr0CIoM+oFddPmLJzL4KB4Y+Z1CJvOc6ir6TmKY9Zqt7Pg4WJz4lg7O+7FTXvce5pz1hwKo92IETPikPjj7XfMs+0xPbvJGerD1gjag+y9NxvoFQoT79wTE96UsUPhK/MD4BEoQ+djAVPvMLFL2cRh6+n0qKPsgJZL7wcmW+xAX4PZpIgD6s2YI9Vi4/vnVRiD4Jxa++uykbPpphTj432UG+lxWZPBPc3D3ht6a+XXzDu5i3o71YYs8+ZXU2voE1MT7DvMw9luklvpF3Dr10d7C+ZTz5vX0mjD2+Xhu+aYqIvc2ykD6ekso8tu8OPsFOnz4mKni+NgyaPAA2bb7Eys8+oE5Zvkszxb3ErTY+bDGBPMVagj61lbK+8BCTvjkJLz48cRM+1gK7vopRCr7524s+fAvYPadiPz5wi/k9KgIPvTJyRb7/P5Q92bR3vgwwhz5oM/U8XK51Pb0V1b10hkw9F0IUvqWdhj58kFk84bGePtr9m75ROlu+b7UhvnXliL526X2+IlT3PA/aqj6Hp947ch9xPMWcUb46+7E+38KwvgVpOj6j+1s+qXSMvmqqPb6FuXI+uSOrvm48jD7XjV89wJWnPg/71D3KH8Q+IlETP89BWb73wJc+aIB4PXnDWD5+q/g98Cm7vsZgXL4CfUQ+dcS5PuKHm73aoak+urTyPgaTjry+pDW+9Imfvl+/8D5ndcC+IaYRvizkhT79Tn89KKuRvukMoL5enUw+cOekPQEvTT1Pwws+3wA8Psb9qrsjqns+z0CGvvHEAr7XHCk+JIlHumGdFDy8osO+4C6ZPsd6WT4zi2a+8dyHvtoEQL7bxKI+FuRSvrE0gzznsWC9DqoUviqBZTxTprk9","1TMAv/BJLD06HUG8qOmVvts4Ez5ZhoK+yLNSPrUcQD4TUgm+pfGQPcq3y75Vya29GrpOPh9vrr31po2+TSnyvNgwGb01cF6+Vklsvib90T5XHoC9MVXfPbDvir2nWHM+u9yDPuJkdb3VCHu9pb/5vacHZL4HjbQ9iHgGPptzFT4E+sM+bbynPtUh7b3tJTe9ucthPJtNpz6tMpw+X4YlvjLzgTwb3TS+zrdLvhNZgT75g+w9NLJkPveylryBD0c6siDJPXamS766aIM+QskHvo0DC76C6BI+cmB4vqqxOj6pbMg+fIFsvi+nFz5UBZc+DsLlPW/fPL5bG3I9tZiNPkaVKDw2SYK8ig3FveOX6L35Wfe8YO+fvoCzNz6LVby+FdKsPoqn/bvTOQc9V1PCPv5j3T65/rG9sXzrvGXBTr7bt6y9XRqgvq85lD6meAM+CEO/vXCmVr472l46DpxqPsGQYD4/LX0+sd2qvRlHRj706Js+XSU+vm+ahD3x1G4+ceSOvh9wEL0u9hw9xL6PPoSprjw1oiq+NM0evTi+0b145q0+YU6RvsiaZr4LAHY+YYNwPp7jnD0Pb62+k8ONvnYUVb4D2VC+vWpYPioRNb26ysM90AIfPhqIh74IACs+CnXMves0gb6Oxa++cxuOPg4aoL6B7w2+QmE1vtdadT6vpC89B4kkPklXCr4BZzC+5alTvg9aKD4PYYW+kvSdPvKpcr6UPxM+HhLdPcTK3r1bYfm9+C13PnevoL57JMg9r3eKvt6thT7985m+zqRIPfdfND4AZ7a+sbG4vomdrb3/E58+f0UNPWcegT3BsmE+3C41PT8Ya749gbY+HIV2vsZcaz5XEaS+4pkCPY9moL45HHG+nulNvp5uPT6TaD2+KcslPnN7jD7ZbZE+1n6UPmcEQj5iCP490JEnvizsfb3G72e9E+ooPiB9hT6IGI29cRpoPh7Z6D0u8RK8r0JxPsfyO77/Jny+EN97vlbKQD7fzJ88dQKIPm64RT6AS/i9","Q52BvsJTtb40sks+LJo/PnEh3TwrRHO9bUJvPvvJvT2kEdI9r+D+vXp5VL3l50Q+l7m7vcT3lD6MEcO+LS7hvYjaFb61POm9Mv57vslwPr6abby8MLbZPYtSCL5I/LY9tghCvjTMWb6HUCc+UakcPH3ZDL6QBFq91QgCPn/8nT6ulK0+xx4UPrHR9r21uUM+O5FcvhjbHz6ws4w+0yINviao2z2cWgk+zsBBvjkpgr5yUfC9ZZBmvXaPhT4hkTk+GcIdvl4hLD5Fw46+TMCAPMEMVz4CK4g9W082vYFdBL4eZtg+1EpwPoFm2L0nDuc+z7iBPrHQ4L3KnWE+PqYGv6lSQrw0gYQ+A8EQPpEppD3i75U5JT/ePW/EtL4VepE+NHQtvhLNVL4B+NQ+i1Buvlf+yj6rXxE9BiuEvgCF0b5N1SK+FSyhvi9t+D1lu74+/7k0PKtMjT7eIZI++ec/vlgN9716sIc9ApCGvmCNqL6nlxG+Da1MvohPcrw3h4S+KwKSPjf6pT72bdA+sjpIPgyNxTzmWIO+lN24vWfYIL6m7qw+/mwEvu5/Yr5AFUk+VlTVPueJj77pV1E+YS/evgHgsr5jwwi+SqmWPnGgUj7xUK8+rmYQPmNiWT5By8q+gPKgPIApfz5j6Ya9nBnRPvGLDD0vpw09SVddvknlsL4="],"bias":["21QjvUNHP70Io4o9C5gFPRGCPL25JkA9WBqcvKhBRbvnmJs9qOcjPd8DkD2VDMC8mZuQPQHuQT1xk+e8w1KoPQ=="]},"out":{"weights":["HyfwPjKkIb0sLo6+3I8fv5htiD1S+Ca/+DziPmKHnz5Dzqs+hqoBv8rYD7+hjoi9ciFxPaQy+r4X2y6/OxLBPqCGB76wBeK+8jrivvx6Hj/vetY+7OMgv7nDsj5VPwS/ZBTpPkbXOz5KNBC/L6YiPZNikz6nG3E+zkPPvnI9Dj8="],"bias":["Sx/ZPE4f2bw="]}},"hash":"e68f59cc6479410b82f9e7b62d25628add2c3f54819ad9f87f375f5904a849ed"}