{"architecture":{"module":"keras.src.models.functional","class_name":"Functional","config":{"name":"functional","trainable":true,"layers":[{"module":"keras.layers","class_name":"InputLayer","config":{"batch_shape":[null,7],"dtype":"float32","sparse":false,"name":"in"},"registered_name":null,"name":"in","inbound_nodes":[]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,7]},"name":"dense1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,7],"dtype":"float32","keras_history":["in",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"out","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":2,"activation":"softmax","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,16]},"name":"out","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,16],"dtype":"float32","keras_history":["dense1",0,0]}}],"kwargs":{}}]}],"input_layers":[["in",0,0]],"output_layers":[["out",0,0]]},"registered_name":"Functional","build_config":{"input_shape":null},"compile_config":{"optimizer":{"module":"keras.optimizers","class_name":"SGD","config":{"name":"SGD","learning_rate":0.009999999776482582,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"momentum":0.0,"nesterov":false},"registered_name":null},"loss":"mse","loss_weights":null,"metrics":null,"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":true}},"image_data_format":"channels_last","input_shapes":[[7]],"output_shapes":[[2]],"trainable_params":{"dense1":{"weights":["/QWSvb4o9L25gfQ7uLUjvqSBebvRZ8W9f7giv94Yib0QufQ9FrfPPiYzxz4oBl4+K/nFPeEh3z4ANSc+3M7RvfmXbb6e4Aw/9D68vi2uor5u8GO9HM7AvsYPXLwaW78+w1QEvnBTBT46j4Y+hqmcvo55zL5R9ww+U+CwvkYLWr6DR30+OA+mPu/dpD7I3Pc92n/kPS01FD6feZm+/3yQvgtCor02dwS/Vx0DvnA/o7w3qli+ZfKmvsUuyT308rE+duOVvlN+1T56W5M+Hs48PLv5XT1+IDy/dzG3vr3vsL2sDwi/sICzvnt/oD45sgC+PLBNvv6rxz0n6QA+B/MevvfkVL74oTK+a1dSPtncCT/9L4O+TpsbPqC0/r3OpLS9WqkEv43zwr6mspK+iK7hO4HZmb4T6Kg8ZUuIvuqiybyRcgi9FQgIv7dFCD419VM+C7WxvvR/CD9YKJO+07iwvqH8nz51Lgc/L/KTPMmCzL5W0fG9VeSgPtIvy75/G1c9cdO8vsQ7vL2+1+8+V7GavH3J1L323dK96Wo2vhi2bz7ni468LigDvx4AGz0od3I8H/rEvnOjBL2zB1O+wIqbPg=="],"bias":["mITPvXvoOj5R2py9TiiouRJ/Vb1M2k0+hRYWPtG4Ir2Gniw+fqQcPk3Qo705mam9mCuavdJll71VB9i92DuBvQ=="]},"out":{"weights":["JvyJvt1rRL3Y2q+9vFoOPwHsjL5ZHKC+fpKGvojikz6kJRS+R8KAPvqx/jvFqs2+sGIjPlKuOL80tvq+oA4vPmel6T4Zc5O+9BIcP4XbMr7gPNk+92nRvmXcJz7LPfU+agwpPkSTGj6CsjS+vOErPOO3sT60CJ2+Cf/QPk2rF78="],"bias":["z15ovc9eaD0="]}},"hash":"669c323bd0a316727409eb3fb988707fba51330abc42cee9f8316f804e1999fd"}