{"architecture":{"module":"keras.src.models.functional","class_name":"Functional","config":{"name":"functional","trainable":true,"layers":[{"module":"keras.layers","class_name":"InputLayer","config":{"batch_shape":[null,15],"dtype":"float32","sparse":false,"name":"in"},"registered_name":null,"name":"in","inbound_nodes":[]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,15]},"name":"dense1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,15],"dtype":"float32","keras_history":["in",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,32]},"name":"dense2","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,32],"dtype":"float32","keras_history":["dense1",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"out","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":2,"activation":"softmax","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,16]},"name":"out","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,16],"dtype":"float32","keras_history":["dense2",0,0]}}],"kwargs":{}}]}],"input_layers":[["in",0,0]],"output_layers":[["out",0,0]]},"registered_name":"Functional","build_config":{"input_shape":null},"compile_config":{"optimizer":{"module":"keras.optimizers","class_name":"SGD","config":{"name":"SGD","learning_rate":0.009999999776482582,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"momentum":0.0,"nesterov":false},"registered_name":null},"loss":"mse","loss_weights":null,"metrics":null,"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":false}},"image_data_format":"channels_last","input_shapes":[[15]],"output_shapes":[[2]],"trainable_params":{"dense1":{"weights":["UwC9PoC7FT4lwUM+9T0zPmyXnb77FM0+H/Nmvr5bmz5QNZc+GjJiPkq8x74LkHY+h/eSvfnHEL2ZaUa+rBquPnMYVL1SB4A+vVbWvr8Pi77x0RQ953ZVPTv7bT44I6y+byjWvC90Xb5ZrJi+T+DlvYlxQD7mE1Y+x4BJvvvgk76lchE+qpGgvaTUir7OWxY+/CcBvr0zFb7GNMm+nF/eveRlAD4WDc6+VtuMvoZoSL29UXg9KjoXPhAk0T2j2pI+9ub/PAxAxL0TEd++BA2evcw1OD1udqc9Gi2QPt9mnT21pl8+N8qtveAisT5dzj4+iQcFvl5Clb2jN02+GS4QPg608TxsVwQ+FJ+EPkiJxT5bk5E+XypaO6+nvryhyCO7LwEevhpY8D3Ow3U+mKAPvv4N7L27JAS+YFeoPZQs7L0fWJq+d9aTvhbIbD1ILjI+vyEhvlZ2ez7Y+Ms93IRIPvDVqj7EfIm+VW3uPV1gRz10aMm+XXuXvWWwbL6tXmi9xduSvo73ir6EQLI9iYKEPp1bPj6O3AY+/T7PvgzQZj6y4wa+LtfHvd4xyT7/PIY+kmbaPqoXub6hb6w9Dvx5vhnQ274GA0Y9WfLYvna2WL3ivCw9i0ytPLYBujzz71K+ZmDMvQdmyLxOJya+4vYfPhx5FT43cBc+Z7UwPtIdmb6oKVa+vyEHPd+kWj5xa4q+j2UBvspwqT3BroO+lbJHvI2hmLxPhq6++y2evNyczz6uNiY+mZunvlBipD604Ge9DGBvvANbSj4vtMO9jL9/vhNPjb6ua6Y9+kXhPIG6uT6MZP69ieiGviYJ8r1oq48+9AjOvv/QUD63jZG+Cq7Bu21Rk775fYG9qDBvPNCJijtsTp+9g2yuvuFas75Bh1o9TS7pvLSkbzzKDYc+yx+jPHzyN75wtwS/MlS4PkfBqD5+Wyc+HTFAPuy18r0Sa3I+753MPWkJ6z5rzdA+Ze7bPuEFzj4Vrq6+7E1mPseNZz0ACeg9sdutPutoXb6WK7++","fjgAPi8EBz67mYQ8z10KPTh5Jj4k9ag+d2JQvVJtiz1s3ay8CoggPHdoZT5aUeS9jlWUPi/9i75oujg+gcS6vY0t3D2L3oA+wEYxPiWvxL0ycXa+eSSvPv+MT71MTlw9s6gePuknyL7fO3I+DvJRPaKcGD5mMJa6TPjZPXGUl71IT5S+h28wPXitpL6Mvdg9Kw5ivDxsEb7OEIC+26ucvTjXJT4szog9PGY0Pgke877SdXm+S/TFPuaYlr0jWxc++tQ5vqLfMD5bKVU+YEhPvRJEqT5365W9NIUbvv1bhD66vDi+NRIfPGxyFL04rwU+11xkvmvwVT5KaZy+y6nJvPjlAr7xjUm9opWFPTHlKT7Bfpe9R+nHPerKrL7HFb883zLqPVCMBj4Mn5g+CMNxPeiJV75mcAi+NSqVPD+c072BdpS+yczNvbboyL3I7si+XqSLPhh5G74cygq+hblFPuJL270rV6E+3Vp4vl7XNL1RS7c+vwVAvnUJKD0jFwq+wunaPdIUij6Yk4U+VIWTvafQEb1ep2k+WjnlPfmKpb7WuoY+uRIgPuHmWL7ZO7w+xzDXvlgWir6GFhs86tnCPqPTfT4uRbS+rb9rPu97aTxqM9g9lAKNvl1wKL6gTyM+Dqmevk1wsj3sPVC+u2txPg5teD47RaS+HxBJPgrAUrwwXKy+QNEGvoORnr5owZI+0HxnPTrmgD7jfYC+SMW1vvDZfL4hKJy+qGFRvryejb7cZH0+ZTobvoDaTT64SEi+LFQSvlgZSj7lo5O+8falvijQjz48tHc+7o6bPvAog7yI9UI+CGoDvtLjjj5wJ1A+6n4FvqEDnL54ZI+9lC4bPtxuvT3o3o6+UAXovWABn7yATOy80NpxvkDP47zJh6S+eOoZvqAS4DzwqV4+JLMQvgCbHj4ayrQ+xE8cPlg+Jr6IjTC9gawOvvKcoj7AeFO+OHfyPWjfaj4VE2O+EByAPAirj74Uxk4+F7lIvghUSz0ijie+4MnrvUxCfj6ohKS9","IBUDPkytLT6qPhC+jEaDPjT9VT7gJ08+yKIJvqgPiT7AgLm8CPxjvYANmbygKHG9VCcUPjDuaD17bIa+PhVGvpgiND4wf3a9MHeSPqDOfLxLbim+N3CdvmdrPr5AS3E8mhqFvm2ajL4IJCe9jC+DPvQtsb04V1A+8HWpPYT6FD4BKF4+mN2NvkM6Sz30n48+hpZqvnxisb55qpu+NfPNPX4WVL4N4pw9U1/nPPipBD5ryDu+2MkJPtqvDr1eXaW+yqb7uiq6670BvIU+fouZvpkHCL6AF8W7uoYivlI4Lj7yYAy+PnO3vWe2UD5UdHI+iwocvozXGD42wsM+v7A0PogvsL4dGaS+iOiJPh/fj7688EI+2Dw/PvSedj6iIKs+ypiivuDrB72WTLE+LvGhPrklEb70+ww+dpFCvnxwVD4RAmO+wguivnjc8D2IKHo9xJqaPvePpr5YC3u90BdrPoCjRzviCJm+PNOzvuA/TL3O6Sm+gRmpvsB5Xr5I25q9"],"bias":["BztzPfDKtbxcTZk8eQ5EvH6F4DzdlDA8J4maPYGDGr1Zehe9OZR2PQvIlj3dRpg9nJs2PR1d0z0ruGO9MBASveSB1j2CVU69Ft++PbrmPTyfUrI9c0HwvL6cvL0ZXHw9QksQvh9ZlT24vkq9mUnLvHs5iT0Uft49/BOTPIsyqj0="]},"dense2":{"weights":["VF/kPRMAEr3R6tA9cLnPPlocNL61mLk+FibfvMyEXj539dm94/SQPpnaiT7d1ZG+YhwkPqMAtz4gU6a+pu/EvYdavL1zuFQ+F3KBuwvZrz6tEDE8rNFBPhPSoT75CDm+5vllPrkkyT4EK4S+6EgevqAeWz62lKc+f8UlOwugLL4KaDC+oUS5vvXXU76u18y+j27/PMMTyr6E33A+oBQfPg/aDj0sW0o+geh3PmnxKj6e6YO9yig2vviV+D13Enm+EiGuPlOCpT5a2YY+GK6tOyyDdz4Tx229AeoRviMcW76WFqU+1C1bPmFzzT7KVYG+CJOjPbsD6b0YpbW9zgu0vpZCFL11do6+jqMEvgZ0kz2BG3Q+qpvmvKIzGr1MU6k+2wmgvmG9lb5OI4M+rfFYPhBtZr1rZn0+CDabPvSd8D07rSq9IKUJPwOQqL3p4OO9c16fPoKgrD5/pce+BdyAvsq7QDw0l8k7Ozk+vmslor4gzRO/BnlWPcPisLuqfGW8A+wevh+MPj4EoKA+jFlmvX//e76NUb0+/yN3Pi56c7630pW+rkP0PsKxkz4Bhba++PGLPmoAhD1QmaW984A5vtqIzD7GsR49fYm3PXTthj3/nSw+WMx+PRW1IT5m9wi8pwPmPvCVUz3j6kC+6jKAvVb1jr7Ghog84X2rPs78yLvn3YE+7gg2vpEHcL4yvuQ+15dEPUB8Rj6i3I6+2WaSPqtpJ767/te9PXSbPtJjAb4maQ0+AxpMvlfgn75mRUy+9Xqmu5RxND0DmtY9vncRvvG9WD4RXUY+q8S8Pn/Wpz6LIEM9T/L0vcz4Or4IyVG+grd/vvYI7D3B4Qk+nB+IPqcruzwVg72+DWg7PdoAPb4Lg6q+b4XKvq477b2qNFs+/jztPekznb5InxO8enCbvj47JD5ve7+8wjTku/wACj4DuZ4+lCE7vueG0D21YtW+ThaFvo2+77ww8EY+nUY8Pj4QB749eVm+HWSYPgb1zr3yzj4+ry6+Pu+cPL53hLG+","w8olviqqyb0qetu+z/epvurluL2vWdk8Wmj8vCTynT6cdny9/apoPeeIOT4AZ2g+u3FlPteIZL6KUH89svdZvuJUQr7RzE++IwTQPot7PT6dbrc+oeEQPSg6qz4ntL2+5quWvbBiqT6Q/kC+K3AWu79OAb2EeAu/BoZ6PnaBkj5B4oG+6scCvf7Y3j7tDsy9e+tyPlj827wO+pc9SkQivUNQrr4MF5y+oK6fvb6gQj2YFHW9G17xPYk0jj7oA6y81A2BPv8+qz5XY1Q+CexSvhRbBz7FY4s9Cp5xvmHJmz59HK2+NXt9vqKJkD5NpiW+Y6ifPpEkUT6c2Gs9S7Ievu1wAz2hmKc+YMCYPgMU1T4w3RG+iyKDPoAoyT5yDqG9DI/bvsA5Yz1xk1E++1dnPXArQb31MDs920q6vs1aqb6Xqgc+eiobPRfD7T2QgSc+pWonPWcoh77TmyW+oXqbvXdJor62bre+ygNqPqyoRb65taw9G/JMvbqleD3AESQ9ti50vhBJAD4D8xs+HYz/PZ1uvL4QHjs+bGqMPvV7sj4TkKk+2tdEvuT3cz2dhgi+Bcj1vYrEp7209bo+S8OOPQ6fu74HUHo+MJqDPvpTyzxvIQC+KJ55vcKckT4P8+i+56plvmZf6zxGKcS7nlWfviAwBr+m4mo9rcOtPEHJxj5I53A9HTuePgKLPjyvnX49F96BPnTGlj2v2O8+YsWDvkMvwb1cJg2+4YQCvnB+Jz7IFSW+rnV4vU6bBj6VKUk+kKGYPg1v9b3AGW29Zy6vviSXiz1ZenC+IQxuPlFqAb5Rizc+GDpqvtz5g7737r+95a+/PnW6+738FY0+xIp2PkYKT704GVY+tlJVvminjb5p2YU+n39fvsafgL1zN8i9z3lWPthlWT6Nq5u+JONEvh/wWT4IjHg+jo6fvqULLL7+wTm+Sfh9PlL2fz4HVw4+NrmgvXEtP74b+7y+bBKlvn3cTz2Okwu+3NBDPltqHz44ZgW//16EPhZsfjr7hMc+","MuFtPr3hiT5EXa4+WHfqvSRIjz7dnsO+Y1M4vtvluz01YEe+MrgAvpVLDD55fJ4+TeqMvjkjjj7XEvm9R2oBO+EhHL5/r5w+KvUrvRjDGr6ICpo+29heviUbqj5gqQs+lZ4svqLHOb1NVY++XVYvvrV2HbzsuLo+/laOvgiqQ73SanU+1mdEPr5ASr6l6R09aKhOPZnBCb6Z3a299LFvvgeZ2b3yO/U7PvgGvuaVqT4HWJO+ghBnvlTXLr5eawA+Q207vn+P0r4dZga+uMa8vh30mj6+Oj4+BcT5PefygL4iB/K8NmiVPe+V2D6Q2B6+KRTzvqNBlz4jeRs9jDFgvpyVG76CoU8+0GZavtFKsb1F5JA9K42SPv+uAzy2EpQ+ed+SvujGkT5nsIK+RdGJvbqcM74fOm2+oBrGPTMR6L2cwg89ZKhYPinAPr6mFby+w+txu/lug761Dk2+5nyJPoWSzD1fR5w9/YgGvmJy3b1a3cy9D1aWPgZGWD7BtgM+EWykPs1ZjD1NRj++MeelPh+e371L/Io9tiMnPXFsL75Qhzs+XHpAvvwDHr5hfp296Z6OPobgYj6Gc+k8Dktfvi6mFD6TX8I9jOFhvpmWnj5L8ok+3JPnPnjftj42QFe+rBKMvcjpkT74hr48roXBvUlKsr5yo7m9UR0Svp0nFz4="],"bias":["dMXRuzHFnj2uBA+9fgw4PrbQUL1zRLI9k24ePYxtKT1ziAw+M8KcPbJu1T2ySmq8XEsCvaC14D2j1MQ9wvUlPQ=="]},"out":{"weights":["HcnnvikV473SHSg/I66CPrq7VT5dHwm//+AYviauPr+yMe29cxL2vnHHFT8G1De90pIfP/T6M76KbtW+7MCmPgbh/zyr58w+9VbAPR/YhL7wGRe+oSSIPrnEDL9OHTe+MRj4vPs63z26EoS+0CKJvIde+r6+UVe+ADHYvCAftDw="],"bias":["PIuXvT2Llz0="]}},"hash":"2809f8c2fd1993a71e177f9fc9382bee694945661c593e5169e41e8a2c66d19a"}